In [2]:
import pandas as pd

series = pd.Series([1,2,3,4,5])
print(series)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
# Creating pandas series from a dictionary

data = {'a':10,'b':20,'c':30}
series2 = pd.Series(data)
print(series2)

a    10
b    20
c    30
dtype: int64

In [4]:
data = {
    'Name':["AKSHAT","name2","name3"],
    'age':[20,21,22],
    'occupation':["SDE","carp","barp"]
}

data_frame_ = pd.DataFrame(data)
print(data_frame_)

     Name  age occupation
0  AKSHAT   20        SDE
1   name2   21       carp
2   name3   22       barp

In [5]:
# A list of dictionaries can also be used to construct the data frame

data = [
    {'name':'akshat','age':20,'occupation':'SWE'},
    {'name':'akshat','age':20,'occupation':'SWE'},
    {'name':'akshat','age':20,'occupation':'SWE'},
    {'name':'akshat','age':20,'occupation':'SWE'}
]

data_frame = pd.DataFrame(data)
print(data_frame)

     name  age occupation
0  akshat   20        SWE
1  akshat   20        SWE
2  akshat   20        SWE
3  akshat   20        SWE

In [6]:
data_frame

data_frame.loc[0]
data_frame.iloc[0]

name          akshat
age               20
occupation       SWE
Name: 0, dtype: object

In [7]:
import math
math.sqrt(5)

2.23606797749979

In [8]:
81*81

6561

In [9]:
data_frame_

     Name  age occupation
0  AKSHAT   20        SDE
1   name2   21       carp
2   name3   22       barp

In [10]:
print(data_frame_.at[0,'age'])
print(data_frame_.at[1,'occupation'])

20
carp

In [11]:
print(data_frame_.iat[2,2])

barp

In [12]:
## Adding a column to the dataframe

data_frame_['salary'] = [50000,60000,70000]

In [13]:
data_frame_

     Name  age occupation  salary
0  AKSHAT   20        SDE   50000
1   name2   21       carp   60000
2   name3   22       barp   70000

In [14]:
data_frame_ = data_frame_.drop('salary',axis = 1)

# OR Do inplace = True

# data_frame_.drop('salary',axis = 1)

In [15]:
data_frame_

     Name  age occupation
0  AKSHAT   20        SDE
1   name2   21       carp
2   name3   22       barp

In [16]:
''' 
Data Manipulation with pandas
'''
#

' \nData Manipulation with pandas\n'

In [17]:
df = pd.read_csv('banklist.csv')

In [18]:
df.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Banks of Wisconsin d/b/a Bank of Kenosha,Kenosha,WI,35386.0,"North Shore Bank, FSB",31-May-13,31-May-13
1,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,Sunrise Bank,Valdosta,GA,58185.0,Synovus Bank,10-May-13,21-May-13
3,Pisgah Community Bank,Asheville,NC,58701.0,"Capital Bank, N.A.",10-May-13,14-May-13
4,Douglas County Bank,Douglasville,GA,21649.0,Hamilton State Bank,26-Apr-13,16-May-13

In [19]:
df.dtypes

Bank Name                 object
City                      object
ST                        object
CERT                     float64
Acquiring Institution     object
Closing Date              object
Updated Date              object
dtype: object

In [20]:
df.isnull().any(axis = 0)

Bank Name                True
City                     True
ST                       True
CERT                     True
Acquiring Institution    True
Closing Date             True
Updated Date             True
dtype: bool

In [21]:
df.isnull().sum()

Bank Name                2
City                     1
ST                       2
CERT                     4
Acquiring Institution    2
Closing Date             1
Updated Date             3
dtype: int64

In [22]:
# df['Bank Name'] = df['Bank Name'].fillna('Bank of America (DUMMY)')
# df['City'] = df['City'].fillna('New York')

# Alternate Method of using dictionaries
missing_value_dict = {
    'Bank Name' : 'Bank of America (DUMMY)', 
    'City' : 'New York',
    'ST' : 'DU',
    'CERT': int(df['CERT'].mean()),
    'Acquiring Institution' : 'Federal Government',
    'Closing Date' : '1- Jan - 13',
    'Updated Date' : '1- Jan - 13'
}


df = df.fillna(missing_value_dict)

In [23]:
df.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Banks of Wisconsin d/b/a Bank of Kenosha,Kenosha,WI,35386.0,"North Shore Bank, FSB",31-May-13,31-May-13
1,Bank of America (DUMMY),New York,DU,31979.0,Federal Government,1- Jan - 13,1- Jan - 13
2,Sunrise Bank,Valdosta,GA,58185.0,Synovus Bank,10-May-13,21-May-13
3,Pisgah Community Bank,Asheville,NC,58701.0,"Capital Bank, N.A.",10-May-13,14-May-13
4,Douglas County Bank,Douglasville,GA,21649.0,Hamilton State Bank,26-Apr-13,16-May-13

In [24]:
# Renaming Columns

df = df.rename(columns={'ST':'State'})

In [25]:
df.dtypes

Bank Name                 object
City                      object
State                     object
CERT                     float64
Acquiring Institution     object
Closing Date              object
Updated Date              object
dtype: object

In [26]:
df['New Cert'] = df['CERT'].astype('int64')

In [27]:
df.head()

,Bank Name,City,State,CERT,Acquiring Institution,Closing Date,Updated Date,New Cert
0,Banks of Wisconsin d/b/a Bank of Kenosha,Kenosha,WI,35386.0,"North Shore Bank, FSB",31-May-13,31-May-13,35386
1,Bank of America (DUMMY),New York,DU,31979.0,Federal Government,1- Jan - 13,1- Jan - 13,31979
2,Sunrise Bank,Valdosta,GA,58185.0,Synovus Bank,10-May-13,21-May-13,58185
3,Pisgah Community Bank,Asheville,NC,58701.0,"Capital Bank, N.A.",10-May-13,14-May-13,58701
4,Douglas County Bank,Douglasville,GA,21649.0,Hamilton State Bank,26-Apr-13,16-May-13,21649

In [28]:
''' 
When using .apply() we typically use it like .apply(lambda x : x**2) , Here x is a series containing the column
when we use .applymap() , the x is an individual element NOT a whole series
'''

' \nWhen using .apply() we typically use it like .apply(lambda x : x**2) , Here x is a series containing the column\nwhen we use .applymap() , the x is an individual element NOT a whole series\n'

In [29]:
df['New Cert'] = df['New Cert'].apply(lambda X : X + 10)
df.head()

,Bank Name,City,State,CERT,Acquiring Institution,Closing Date,Updated Date,New Cert
0,Banks of Wisconsin d/b/a Bank of Kenosha,Kenosha,WI,35386.0,"North Shore Bank, FSB",31-May-13,31-May-13,35396
1,Bank of America (DUMMY),New York,DU,31979.0,Federal Government,1- Jan - 13,1- Jan - 13,31989
2,Sunrise Bank,Valdosta,GA,58185.0,Synovus Bank,10-May-13,21-May-13,58195
3,Pisgah Community Bank,Asheville,NC,58701.0,"Capital Bank, N.A.",10-May-13,14-May-13,58711
4,Douglas County Bank,Douglasville,GA,21649.0,Hamilton State Bank,26-Apr-13,16-May-13,21659

In [30]:
# Data Aggregating And grouping

grouped = df.groupby(['State','City'])['CERT'].mean()
grouped

State  City
AL     Birmingham      19891.333333
       Fort Deposit    24957.000000
       Irondale        32276.000000
       Montgomery       9609.000000
       Sylacauga       35224.000000
                           ...
WI     Racine          18321.000000
       Stoughton        5328.000000
       West Allis      28612.000000
WV     Northfork        6782.000000
WY     Thermopolis     22754.000000
Name: CERT, Length: 405, dtype: float64

In [31]:
# First DataFrame: Employee details
df1 = pd.DataFrame({
    'EmployeeID': [101, 102, 103, 104],
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Department': ['HR', 'Finance', 'IT', 'Marketing']
})

# Second DataFrame: Employee salary details
df2 = pd.DataFrame({
    'EmployeeID': [101, 102, 105],
    'Salary': [50000, 60000, 70000],
    'Bonus': [5000, 7000, 8000]
})

In [32]:
df1.merge(df2,how = 'left')

   EmployeeID     Name Department   Salary   Bonus
0         101    Alice         HR  50000.0  5000.0
1         102      Bob    Finance  60000.0  7000.0
2         103  Charlie         IT      NaN     NaN
3         104    David  Marketing      NaN     NaN

In [33]:
df1.merge(df2,how = "right")

   EmployeeID   Name Department  Salary  Bonus
0         101  Alice         HR   50000   5000
1         102    Bob    Finance   60000   7000
2         105    NaN        NaN   70000   8000

In [35]:
df1.merge(df2,how = "inner")

   EmployeeID   Name Department  Salary  Bonus
0         101  Alice         HR   50000   5000
1         102    Bob    Finance   60000   7000

In [36]:
df1.merge(df2,how = "outer")

   EmployeeID     Name Department   Salary   Bonus
0         101    Alice         HR  50000.0  5000.0
1         102      Bob    Finance  60000.0  7000.0
2         103  Charlie         IT      NaN     NaN
3         104    David  Marketing      NaN     NaN
4         105      NaN        NaN  70000.0  8000.0

In [39]:
# Reading Data From Various Sources in pandas 
from io import StringIO

json_string = '{"name": ["John", "Jane"], "age": [28, 34]}'
json_data = StringIO(json_string)

df = pd.read_json(json_data)
df

   name  age
0  John   28
1  Jane   34

In [47]:
json = df.to_json(orient = "values")
json

'[["John",28],["Jane",34]]'

In [75]:
ucl_df_all = pd.read_html('https://en.wikipedia.org/wiki/List_of_European_Cup_and_UEFA_Champions_League_finals')
ucl_df_all[2]
ucl_df = ucl_df_all[2]


ucl_df = ucl_df.fillna('TBD')
ucl_df = ucl_df.drop([70,71,72,73])
ucl_df = ucl_df.rename(columns={'Country' : "Winner's Country",'Country.1':"Runners-up's Country","Attend­ance[15]":"Attend­ance"})
ucl_df.to_csv('ucl_data.csv',index=False)
ucl_df.tail()

,Season,Winner's Country,Winners,Score,Runners-up,Runners-up's Country,Venue,Attend­ance
65,2019–20,Germany,Bayern Munich,1–0,Paris Saint-Germain,France,"Estádio da Luz, Lisbon, Portugal",0[l]
66,2020–21,England,Chelsea,1–0,Manchester City,England,"Estádio do Dragão, Porto, Portugal","14,110[m]"
67,2021–22,Spain,Real Madrid,1–0,Liverpool,England,"Stade de France, Saint-Denis, France",75000
68,2022–23,England,Manchester City,1–0,Inter Milan,Italy,"Atatürk Olympic Stadium, Istanbul, Turkey",71412
69,2023–24,Spain,Real Madrid,2–0,Borussia Dortmund,Germany,"Wembley Stadium, London, England",86212